In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.shape

(18241, 5)

###### 6.1 Dropping single column

In [7]:
ufo.drop('Colors Reported',axis=1,inplace = True)

In [8]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

To drop the coloumn 'Colors Reported' we have drop method  on our data frame . Inside parenthesis 1st argument we place column name in this case it is 'Colors Reported' then 'axis=1' . option post axis  signifies that weather we are looking to drop row or coloumn in this case as we are dropping column we select 1 else we will select 0 . After that 'inplace = True' is used to confirm changes in the orignal data set.

###### 6.2 Dropping multiple column

In [9]:
ufo.drop(['City', 'State'],axis=1,inplace = True)

In [14]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

We can see that changes are made. This is achieved by passing a list of column names instead of one column.

###### 6.3 Dropping Rows

In [15]:
ufo.drop([0,1],axis=0,inplace = True)

In [16]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

we can see that 1st two rows i.e  data for 1930 is removed ,Here column names are replaced with row number/indices and axis=1 is chnaged to axis=0